src/cf/InformationRegisters/ОшибкиCouchDB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиCouchDB</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/CouchDB_Сервер/Ext/Module.bsl
Процедура ЗаписатьОшибку(ИмяБазы, Действие, ОтветHTTP, Сообщать=Ложь) Экспорт
	НоваяЗапись=РегистрыСведений.ОшибкиCouchDB.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период=ТекущаяДата();
	НоваяЗапись.ИмяБазы=ИмяБазы;
	НоваяЗапись.Действие=Действие;
	Если ТипЗнч(ОтветHTTP)=Тип("Строка") Тогда
		НоваяЗапись.Описание=ОтветHTTP;
	Иначе
		НоваяЗапись.Код=ОтветHTTP.КодСостояния;
		НоваяЗапись.Описание=ОтветHTTP.ПолучитьТелоКакСтроку();	
	КонецЕсли;	
	НоваяЗапись.Записать(Ложь);

	Если Сообщать Тогда		
		стрОшибка="Ошибка CouchDB:"+Действие;
		Если НЕ ТипЗнч(ОтветHTTP)=Тип("Строка") Тогда
			стрОшибка=стрОшибка+", код ошибки:"+ОтветHTTP.КодСостояния;
		КонецЕсли;
		Сообщить(стрОшибка);
	КонецЕсли;	
КонецПроцедуры

Функция ПрочитатьОтвет(Ответ) Экспорт
	ЧтениеJSON=Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(?(ТипЗнч(Ответ)=Тип("HTTPОтвет"), Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8), Ответ));
	Данные=ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();
	Возврат Данные;
КонецФункции
